
#+Title: Invoice Template
#+Author: Jaxson Van Doorn

#+OPTIONS: toc:nil title:nil num:nil

#+LATEX_HEADER: \usepackage[letterpaper,tmargin=0.5in,bmargin=1.0in,lmargin=1.0in,rmargin=1.0in,headheight=0in,headsep=0in,footskip=0.0in]{geometry}
#+LATEX_HEADER: \usepackage[labelformat=empty, textformat=empty]{caption}
#+LATEX_HEADER: \parindent 0in
#+LATEX_HEADER: \parskip 0.1in
#+LATEX_HEADER: \newcommand{\indent}{\tab}
#+LATEX_HEADER: \newcommand{\pair}[2]{{\bf #1:} \\ \indent #2 \\}

#+MACRO: FIRST     Jaxson
#+MACRO: LAST      Van Doorn
#+MACRO: FULL      {{{FIRST}}} {{{LAST}}}
#+MACRO: EMAIL     jaxson.vandoorn@gmail.com
#+MACRO: ADDRESS1  8636 Sentinel Place
#+MACRO: ADDRESS2  North Saanich, BC
#+MACRO: ADDRESS3  V8L 4Z8
#+MACRO: TITLE     Invoice

#+CONSTANTS: rate=20

#+MACRO: CLIENT_NAME Woofers Inc
#+MACRO: CLIENT_ADDRESS1 1234 Woof Street
#+MACRO: CLIENT_ADDRESS2 Dog City, BC
#+MACRO: CLIENT_ADDRESS3 W9B 2D5
#+BEGIN: clocktable :scope file :maxlevel 3
#+TBLFM: @2$5..@>$5=vsum($2..$4)*$rate;t::@1$5=string("Amount($)")::@2$6..@>$6=$rate::@1$6=string("Rate($)")
#+END:

* Work :noexport:
** TODO X
   :LOGBOOK:
   CLOCK: [2019-01-12 Sat 22:13]--[2019-01-12 Sat 23:13] =>  1:00
   :END:
*** TODO Implement X
   :LOGBOOK:
   CLOCK: [2019-01-12 Sat 22:13]--[2019-01-12 Sat 23:13] =>  1:00
   :END:
** TODO Y
*** TODO Implement Y
   :LOGBOOK:
   CLOCK: [2019-01-12 Sat 19:00]--[2019-01-12 Sat 19:20] =>  0:20
   :END:
*** TODO Debug Y
   :LOGBOOK:
   CLOCK: [2019-01-12 Sat 23:13]--[2019-01-12 Sat 23:59] =>  0:46
   :END:
** TODO Z
*** TODO Code Review Z
   CLOCK: [2019-01-12 Sat 1:13]--[2019-01-12 Sat 1:23] =>  0:10
* Lisp :noexport:

#+NAME: startup
#+BEGIN_SRC emacs-lisp
(defadvice org-table-goto-column
    (before
     always-make-new-columns
     (n &optional on-delim force)
     activate)
  "always adds new columns when we move to them"
  (setq force t))
#+END_SRC

# Local Variables:
# eval: (progn (org-babel-goto-named-src-block "startup") (org-babel-execute-src-block) (outline-hide-sublevels 1))
# End:
